In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[-0.15473265,  0.38824711, -0.15230252],
       [ 0.54521908, -0.36600696, -0.60227682],
       [-1.86704486, -0.36920497, -0.22956469],
       [ 0.42904151,  0.34470659, -0.38742206]])

In [5]:
data_frame = pd.DataFrame(data)

In [6]:
data_frame

          0         1         2
0 -0.154733  0.388247 -0.152303
1  0.545219 -0.366007 -0.602277
2 -1.867045 -0.369205 -0.229565
3  0.429042  0.344707 -0.387422

In [7]:
type(data_frame)

pandas.core.frame.DataFrame

In [8]:
type(data_frame[0])

pandas.core.series.Series

In [9]:
new_df = pd.DataFrame(data, index = ["Zeynep", "Ayşe", "Nehir", "Güneş"], columns = ["Salary", "Age", "Seniority"])

In [10]:
new_df

          Salary       Age  Seniority
Zeynep -0.154733  0.388247  -0.152303
Ayşe    0.545219 -0.366007  -0.602277
Nehir  -1.867045 -0.369205  -0.229565
Güneş   0.429042  0.344707  -0.387422

In [11]:
new_df["Age"]

Zeynep    0.388247
Ayşe     -0.366007
Nehir    -0.369205
Güneş     0.344707
Name: Age, dtype: float64

In [12]:
new_df["Salary"]

Zeynep   -0.154733
Ayşe      0.545219
Nehir    -1.867045
Güneş     0.429042
Name: Salary, dtype: float64

In [14]:
new_df[["Age", "Salary"]]

             Age    Salary
Zeynep  0.388247 -0.154733
Ayşe   -0.366007  0.545219
Nehir  -0.369205 -1.867045
Güneş   0.344707  0.429042

In [15]:
new_df.loc["Zeynep"]

Salary      -0.154733
Age          0.388247
Seniority   -0.152303
Name: Zeynep, dtype: float64

In [16]:
new_df.iloc[0]

Salary      -0.154733
Age          0.388247
Seniority   -0.152303
Name: Zeynep, dtype: float64

In [17]:
new_df.iloc[1]

Salary       0.545219
Age         -0.366007
Seniority   -0.602277
Name: Ayşe, dtype: float64

In [18]:
new_df

          Salary       Age  Seniority
Zeynep -0.154733  0.388247  -0.152303
Ayşe    0.545219 -0.366007  -0.602277
Nehir  -1.867045 -0.369205  -0.229565
Güneş   0.429042  0.344707  -0.387422

In [20]:
new_df.iloc[:,2]

Zeynep   -0.152303
Ayşe     -0.602277
Nehir    -0.229565
Güneş    -0.387422
Name: Seniority, dtype: float64

In [21]:
new_df["Age"]

Zeynep    0.388247
Ayşe     -0.366007
Nehir    -0.369205
Güneş     0.344707
Name: Age, dtype: float64

In [22]:
new_df["Extra"] = 10

In [23]:
new_df

          Salary       Age  Seniority  Extra
Zeynep -0.154733  0.388247  -0.152303     10
Ayşe    0.545219 -0.366007  -0.602277     10
Nehir  -1.867045 -0.369205  -0.229565     10
Güneş   0.429042  0.344707  -0.387422     10

In [24]:
new_df.drop("Extra", axis=1)

          Salary       Age  Seniority
Zeynep -0.154733  0.388247  -0.152303
Ayşe    0.545219 -0.366007  -0.602277
Nehir  -1.867045 -0.369205  -0.229565
Güneş   0.429042  0.344707  -0.387422

In [25]:
new_df

          Salary       Age  Seniority  Extra
Zeynep -0.154733  0.388247  -0.152303     10
Ayşe    0.545219 -0.366007  -0.602277     10
Nehir  -1.867045 -0.369205  -0.229565     10
Güneş   0.429042  0.344707  -0.387422     10

In [27]:
new_df.drop("Extra", axis=1, inplace=True)

In [28]:
new_df

          Salary       Age  Seniority
Zeynep -0.154733  0.388247  -0.152303
Ayşe    0.545219 -0.366007  -0.602277
Nehir  -1.867045 -0.369205  -0.229565
Güneş   0.429042  0.344707  -0.387422

In [34]:
new_df["Güneş"] = 10

In [35]:
new_df

          Salary       Age  Seniority  Güneş
Zeynep -0.154733  0.388247  -0.152303     10
Ayşe    0.545219 -0.366007  -0.602277     10
Nehir  -1.867045 -0.369205  -0.229565     10
Güneş   0.429042  0.344707  -0.387422     10

In [36]:
new_df.drop("Güneş")

          Salary       Age  Seniority  Güneş
Zeynep -0.154733  0.388247  -0.152303     10
Ayşe    0.545219 -0.366007  -0.602277     10
Nehir  -1.867045 -0.369205  -0.229565     10

In [37]:
new_df

          Salary       Age  Seniority  Güneş
Zeynep -0.154733  0.388247  -0.152303     10
Ayşe    0.545219 -0.366007  -0.602277     10
Nehir  -1.867045 -0.369205  -0.229565     10
Güneş   0.429042  0.344707  -0.387422     10

In [38]:
new_df.drop("Güneş", axis=1, inplace=True)

In [39]:
new_df

          Salary       Age  Seniority
Zeynep -0.154733  0.388247  -0.152303
Ayşe    0.545219 -0.366007  -0.602277
Nehir  -1.867045 -0.369205  -0.229565
Güneş   0.429042  0.344707  -0.387422

In [40]:
new_df.drop("Güneş", axis=0)

          Salary       Age  Seniority
Zeynep -0.154733  0.388247  -0.152303
Ayşe    0.545219 -0.366007  -0.602277
Nehir  -1.867045 -0.369205  -0.229565

In [41]:
new_df

          Salary       Age  Seniority
Zeynep -0.154733  0.388247  -0.152303
Ayşe    0.545219 -0.366007  -0.602277
Nehir  -1.867045 -0.369205  -0.229565
Güneş   0.429042  0.344707  -0.387422

In [43]:
new_df.loc["Nehir"]

Salary      -1.867045
Age         -0.369205
Seniority   -0.229565
Name: Nehir, dtype: float64

In [45]:
new_df.loc["Nehir"]["Salary"]

-1.8670448620035285

In [46]:
new_df.loc["Nehir","Salary"]

-1.8670448620035285

In [47]:
new_df.loc["Nehir","Salary"] = 100

In [48]:
new_df

            Salary       Age  Seniority
Zeynep   -0.154733  0.388247  -0.152303
Ayşe      0.545219 -0.366007  -0.602277
Nehir   100.000000 -0.369205  -0.229565
Güneş     0.429042  0.344707  -0.387422

In [49]:
new_df > 0

        Salary    Age  Seniority
Zeynep   False   True      False
Ayşe      True  False      False
Nehir     True  False      False
Güneş     True   True      False

In [50]:
boolean_frame = new_df > 0

In [51]:
new_df[boolean_frame]

            Salary       Age  Seniority
Zeynep         NaN  0.388247        NaN
Ayşe      0.545219       NaN        NaN
Nehir   100.000000       NaN        NaN
Güneş     0.429042  0.344707        NaN

In [52]:
new_df[new_df > 0]

            Salary       Age  Seniority
Zeynep         NaN  0.388247        NaN
Ayşe      0.545219       NaN        NaN
Nehir   100.000000       NaN        NaN
Güneş     0.429042  0.344707        NaN

In [53]:
new_df[new_df["Salary"] > 1]

       Salary       Age  Seniority
Nehir   100.0 -0.369205  -0.229565

In [54]:
new_df

            Salary       Age  Seniority
Zeynep   -0.154733  0.388247  -0.152303
Ayşe      0.545219 -0.366007  -0.602277
Nehir   100.000000 -0.369205  -0.229565
Güneş     0.429042  0.344707  -0.387422

In [55]:
new_df[new_df["Age"] > 0]

          Salary       Age  Seniority
Zeynep -0.154733  0.388247  -0.152303
Güneş   0.429042  0.344707  -0.387422

In [56]:
new_df

            Salary       Age  Seniority
Zeynep   -0.154733  0.388247  -0.152303
Ayşe      0.545219 -0.366007  -0.602277
Nehir   100.000000 -0.369205  -0.229565
Güneş     0.429042  0.344707  -0.387422

In [57]:
new_df.reset_index()

    index      Salary       Age  Seniority
0  Zeynep   -0.154733  0.388247  -0.152303
1    Ayşe    0.545219 -0.366007  -0.602277
2   Nehir  100.000000 -0.369205  -0.229565
3   Güneş    0.429042  0.344707  -0.387422

In [58]:
reset_frame = new_df.reset_index()

In [59]:
reset_frame

    index      Salary       Age  Seniority
0  Zeynep   -0.154733  0.388247  -0.152303
1    Ayşe    0.545219 -0.366007  -0.602277
2   Nehir  100.000000 -0.369205  -0.229565
3   Güneş    0.429042  0.344707  -0.387422

In [60]:
reset_frame.loc[0]

index          Zeynep
Salary      -0.154733
Age          0.388247
Seniority   -0.152303
Name: 0, dtype: object

In [61]:
new_indices = ["Ze", "Ay", "Ne", "Gü"]

In [62]:
new_df["NewIndex"] = new_indices

In [63]:
new_df

            Salary       Age  Seniority NewIndex
Zeynep   -0.154733  0.388247  -0.152303       Ze
Ayşe      0.545219 -0.366007  -0.602277       Ay
Nehir   100.000000 -0.369205  -0.229565       Ne
Güneş     0.429042  0.344707  -0.387422       Gü

In [64]:
new_df.set_index("NewIndex", inplace=True)

In [65]:
new_df

              Salary       Age  Seniority
NewIndex
Ze         -0.154733  0.388247  -0.152303
Ay          0.545219 -0.366007  -0.602277
Ne        100.000000 -0.369205  -0.229565
Gü          0.429042  0.344707  -0.387422

In [66]:
new_df.loc["Ne"]

Salary       100.000000
Age           -0.369205
Seniority     -0.229565
Name: Ne, dtype: float64

In [67]:
#multi index

In [68]:
first_index = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [69]:
inner_index = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [70]:
zipped_index = list(zip(first_index, inner_index))

In [71]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [72]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [73]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [74]:
sample_values = np.ones((6,2))

In [75]:
big_df = pd.DataFrame(sample_values, index=zipped_index, columns = ["Age", "Salary"])

In [76]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [77]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [78]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [79]:
big_df.loc["Simpson"].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64